{
  "topics": [
    {
      "topic": "Liquidity Risk",
      "sub_topics": [
        "Liquidity risk encompasses both asset liquidity risk (also known as market/product liquidity risk) and funding liquidity risk. Asset liquidity risk arises when the liquidation value of assets significantly deviates from their mark-to-market values, influenced by the price impact of trades and position sizes. Funding liquidity risk, or cash-flow liquidity risk, stems from the inability to meet payment obligations to creditors or investors, potentially forcing the undesired liquidation of a portfolio, particularly in leveraged financial institutions where posting collateral is common. Understanding liquidity risk necessitates knowledge of market microstructure, focusing on market mechanisms and optimal trade execution to minimize trading costs and manage balance sheet assets and liabilities.",
        "Traditional Value-at-Risk (VaR) models typically assume a 'frozen' portfolio and that market prices represent achievable transaction prices, suitable for quantifying and controlling risk in ongoing portfolios. However, this assumption becomes questionable when representing the worst-case loss during a liquidation period. Immediate liquidation can lead to losses due to market impact, where the liquidation value falls relative to mark-to-market prices. Liquidation over several days should balance transaction costs and price risk, leading to a Liquidity-Adjusted VaR (LVAR) measure. Incorporating liquidity into VaR measurements involves considering market impact, where immediate liquidation can cause losses due to a drop in liquidation value relative to market prices.",
        "Managing asset liquidity risk traditionally involves position limits to restrict exposure to a single instrument, even if it provides market risk diversification, to avoid significant market impact during forced liquidation. Asset liquidity can be quantified using a price-quantity function, also known as the market impact effect. Liquid markets, such as major currencies or Treasury securities, are characterized by deep markets where positions can be offset with minimal price impact. Conversely, 'thin' markets, like exotic over-the-counter (OTC) derivatives or some emerging market stocks, are those where any transaction can rapidly affect prices. Measuring asset liquidity risk can be done through the bid-ask spread, defined in relative terms and influenced by order processing, asymmetric information, and inventory maintenance costs.",
        "The primary defense against funding liquidity risk includes cash reserves, followed by credit lines, and the ability to raise funds from alternative sources like new debt or equity issuances. However, securing new funding can be challenging when the institution is underperforming and requires it most. Assessing funding liquidity risk involves examining the institution's asset and liability structure, as well as potential cash demands, comparing available cash with payment obligations, as proposed by the Counterparty Risk Management Policy Group (CRMPG). In a bidirectional mark-to-market swap, any cash payment should be offset by a receipt on the other leg, with the only risk being a delay in receipt. However, in an unsecured, unidirectional mark-to-market swap, the institution is subject to timing mismatches in collateral payments if the first swap loses money, necessitating a longer-term horizon.",
        "Liquidity-Adjusted Value-at-Risk (LVAR) is a hybrid measure combining price volatility with liquidation costs, incorporating the total execution cost and price risk components consistently. It minimizes the total LVAR based on the liquidation duration. Practical implementation of LVAR involves using a price-quantity function for all portfolio securities, estimating the price impact of liquidation based on historical bid-ask spreads, median trading volume, and recent volatility. Traditional adjustments for liquidity risk are often ad hoc, but can be incorporated into VaR measures by ensuring the time horizon exceeds an orderly liquidation period or artificially increasing the volatility of certain assets.",
        "Traditional VaR models measure the worst-case change in mark-to-market value over the horizon but do not account for the actual cost of liquidation, which depends on the price impact function and the size of positions. This leads to a 'hybrid' liquidity-adjusted VaR measure that combines price volatility with liquidation costs. In general, bid-ask spread effects are less significant than traditional VaR measures; large price drops due to liquidating large positions matter more. In normal markets, liquidity effects are reasonably predictable; however, the applicability of these LVAR measures to stressed markets is more doubtful. An alternative approach is to value positions at the conservative bid or ask quote and even set aside a reserve to account for illiquidity; in these cases, there is no need to account for liquidity risk in the VaR because it is already incorporated into the valuation of the positions. Funding liquidity risk, in contrast, arises when funding for the portfolio cannot be maintained; here again, the VaR can be altered to estimate the risk that a portfolio could run out of cash. The greater the liquidation horizon for a portfolio, the greater the need for extended funding of the portfolio.",
        "The LTCM case demonstrates the importance of liquidity risk management, highlighting how high leverage, lack of diversification, and the inability to liquidate positions promptly can lead to significant losses and the need for financial bailouts. Long-Term Capital Management (LTCM) utilized a staggering leverage ratio of 25:1, with off-balance-sheet positions, including swaps, options, and other derivatives, totaling a notional value of $1.25 trillion. LTCM leveraged its balance sheet through repurchase agreements (repos) with commercial and investment banks, where the value of assets or collateral exceeded the borrowed money by an amount known as a haircut. LTCM's strategy profited handsomely from narrowing credit spreads during the early years, leading to after-tax returns above 40%. However, a crisis in the mortgage-backed securities market and Russia's moratorium on its debt led to a reassessment of credit and sovereign risks across financial markets, causing LTCM to lose $550 million on August 21 alone. LTCM failed due to its inability to manage its risk, partly because its trades were quite undiversified; all trades were exposed to increasing market volatility and decreasing liquidity. The episode also raised questions about the soundness of brokers' risk management systems, which were lulled into thinking they were protected because their loans were 'fully collateralized'. The Federal Reserve Bank of New York organized a bailout of LTCM in September 1998, with 14 banks investing $3.6 billion in exchange for a 90% stake in the company, averting a collapse."
      ]
    }
  ]
}